tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "planetscale/tap"
brew "awscli"
brew "bat"
brew "exa"
brew "gh"
brew "git"
brew "mysql-client"
brew "neofetch"
brew "nvm"
brew "python@3.10"
brew "qt@5"
brew "sl"
brew "trash"
brew "youtube-dl"
brew "planetscale/tap/pscale"
cask "alt-tab"
cask "anydesk"
cask "brave-browser"
cask "cinebench"
cask "discord"
cask "figma"
cask "firefox"
cask "google-chrome"
cask "iina"
cask "imageoptim"
cask "messenger"
cask "mongodb-compass"
cask "mouse-fix"
cask "notion"
cask "numi"
cask "pycharm"
cask "rectangle"
cask "shottr"
cask "slack"
cask "spotify"
cask "stats"
cask "tempbox"
cask "visual-studio-code"
cask "warp"
