tap "cargo-lambda/cargo-lambda"
tap "homebrew/bundle"
tap "homebrew/services"
tap "planetscale/tap"

brew "openssl@3"
brew "aws-sam-cli"
brew "python@3.12"
brew "awscli"
brew "bat"
brew "docker"
brew "dotnet"
brew "eza"
brew "gh"
brew "git"
brew "mysql-client"
brew "neofetch"
brew "node"
brew "nvm"
brew "openssl@1.1"
brew "php"
brew "pnpm"
brew "psutils"
brew "python@3.10"
brew "python@3.11"
brew "qt@5"
brew "serverless"
brew "sl"
brew "trash", link: true
brew "youtube-dl"
brew "cargo-lambda/cargo-lambda/cargo-lambda"
brew "planetscale/tap/pscale"

cask "alt-tab"
cask "anydesk"
cask "arc"
cask "brave-browser"
cask "cinebench"
cask "dbeaver-community"
cask "discord"
cask "figma"
cask "firefox"
cask "google-chrome"
cask "iina"
cask "imageoptim"
cask "mac-mouse-fix"
cask "maccy"
cask "messenger"
cask "middleclick"
cask "mongodb-compass"
cask "notion"
cask "numi"
cask "parsec"
cask "pycharm"
cask "raycast"
cask "rectangle"
cask "rider"
cask "rocket"
cask "rustrover"
cask "shottr"
cask "slack"
cask "spotify"
cask "stats"
cask "tempbox"
cask "vanilla"
cask "visual-studio-code"
cask "warp"
cask "zed"

vscode "astro-build.astro-vscode"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradlc.vscode-tailwindcss"
vscode "britesnow.vscode-toggle-quotes"
vscode "cardinal90.multi-cursor-case-preserve"
vscode "christian-kohler.path-intellisense"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "fill-labs.dependi"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "foxundermoon.shell-format"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "glenn2223.live-sass"
vscode "golang.go"
vscode "irongeek.vscode-env"
vscode "meganrogge.template-string-converter"
vscode "mflo999.lintel"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.dotnet-interactive-vscode"
vscode "ms-dotnettools.vscode-dotnet-pack"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vsliveshare.vsliveshare"
vscode "oderwat.indent-rainbow"
vscode "pkief.material-icon-theme"
vscode "pmndrs.pmndrs"
vscode "prisma.prisma"
vscode "rapidapi.vscode-rapidapi-client"
vscode "rapidapi.vscode-services"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "rust-lang.rust-analyzer"
vscode "steoates.autoimport"
vscode "streetsidesoftware.code-spell-checker"
vscode "syler.sass-indented"
vscode "tamasfe.even-better-toml"
vscode "tomoki1207.pdf"
vscode "torresgol10.bootstrap-class-autocomplete"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "vscodevim.vim"
vscode "yoavbls.pretty-ts-errors"
vscode "zhuangtongfa.material-theme"
