tap "cargo-lambda/cargo-lambda"
tap "homebrew/bundle"
tap "homebrew/services"
tap "planetscale/tap"

brew "openssl@3"
brew "aws-sam-cli"
brew "awscli"
brew "bat"
brew "docker"
brew "openssl@1.1"
brew "dotnet"
brew "exa"
brew "gh"
brew "git"
brew "mysql-client"
brew "neofetch"
brew "node"
brew "nvm"
brew "pnpm"
brew "python@3.10"
brew "qt@5"
brew "sl"
brew "trash"
brew "youtube-dl"
brew "cargo-lambda/cargo-lambda/cargo-lambda"
brew "planetscale/tap/pscale"

cask "alt-tab"
cask "anydesk"
cask "arc"
cask "brave-browser"
cask "cinebench"
cask "discord"
cask "figma"
cask "firefox"
cask "google-chrome"
cask "iina"
cask "imageoptim"
cask "maccy"
cask "messenger"
cask "middleclick"
cask "mongodb-compass"
cask "mouse-fix"
cask "notion"
cask "numi"
cask "parsec"
cask "pycharm"
cask "raycast"
cask "rectangle"
cask "rider"
cask "rocket"
cask "shottr"
cask "slack"
cask "spotify"
cask "stats"
cask "tempbox"
cask "vanilla"
cask "visual-studio-code"
cask "warp"

vscode "astro-build.astro-vscode"
vscode "bradlc.vscode-tailwindcss"
vscode "BriteSnow.vscode-toggle-quotes"
vscode "Cardinal90.multi-cursor-case-preserve"
vscode "christian-kohler.path-intellisense"
vscode "dbaeumer.vscode-eslint"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "GitHub.remotehub"
vscode "github.vscode-github-actions"
vscode "GitHub.vscode-pull-request-github"
vscode "glenn2223.live-sass"
vscode "IronGeek.vscode-env"
vscode "meganrogge.template-string-converter"
vscode "mflo999.lintel"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-dotnettools.vscodeintellicode-csharp"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-repositories"
vscode "ms-vsliveshare.vsliveshare"
vscode "oderwat.indent-rainbow"
vscode "PKief.material-icon-theme"
vscode "pmndrs.pmndrs"
vscode "Prisma.prisma"
vscode "RapidAPI.vscode-rapidapi-client"
vscode "rapidapi.vscode-services"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.LiveServer"
vscode "rust-lang.rust-analyzer"
vscode "serayuzgur.crates"
vscode "steoates.autoimport"
vscode "streetsidesoftware.code-spell-checker"
vscode "syler.sass-indented"
vscode "tamasfe.even-better-toml"
vscode "vscodevim.vim"
vscode "yoavbls.pretty-ts-errors"
vscode "zhuangtongfa.material-theme"
